cosc583/hw3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-03 Wed 09:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hw3</title>
<meta name="author" content="Jackson Mowry" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Hw3</h1>
<ol class="org-ol">
<li>Pseudocode for the padding function described in Section 5.1.1.</li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Equation we're trying to solve l + 1 + k == 448mod512</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Simplifies to 448 - (l + 1) = k</span>

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">pad_message</span>(message: u1[]) -&gt; void:
    <span style="color: #dcaeea;">message_len</span>: <span style="color: #ECBE7B;">u64</span> = length of message <span style="color: #51afef;">in</span> bits
    <span style="color: #dcaeea;">k</span> = 448 - (message_len + 1)

    <span style="color: #dcaeea;">message</span> += 1
    <span style="color: #51afef;">for</span> 0 to k:
        <span style="color: #dcaeea;">message</span> += 0
    end

    <span style="color: #dcaeea;">message</span> += message_len <span style="color: #51afef;">as</span> u1[]

</pre>
</div>

<ol class="org-ol">
<li>Pseudocode for calculating the messaging schedule (W<sub>t</sub>) described in Section 6.1.2.</li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">def</span> <span style="color: #c678dd;">message_schedule</span>(message: u1[], block: u32) -&gt; u32[]:
    <span style="color: #dcaeea;">current_block</span> = message[(block * 512)..(block * 512 + 512)]
    <span style="color: #dcaeea;">w</span>: <span style="color: #ECBE7B;">u32</span>[] = []

    <span style="color: #51afef;">for</span> <span style="color: #dcaeea;">i</span> = 0 to 80:
        <span style="color: #51afef;">if</span> i &gt;= 0 &amp;&amp; i &lt;= 15:
            <span style="color: #dcaeea;">w</span> += current_block[(i * 32)..(i * 32 + 32)]
        <span style="color: #51afef;">else</span>
            <span style="color: #dcaeea;">w</span> += rotl(w[i-3] ^ w[i-8] ^ w[t-14] ^ w[t-16])
        fi
    end

    <span style="color: #51afef;">return</span> w
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Wed Sep  3 09:33:29 2025</p>
<p class="author">Author: Jackson Mowry</p>
<p class="date">Created: 2025-09-03 Wed 09:34</p>
</div>
</body>
</html>
